---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.DpartLayerIndex
source: html/cf5689e8-8dcf-7152-6f9b-a29d58e8b1e1.htm
---
# Autodesk.Revit.DB.ParameterTypeId.DpartLayerIndex Property

"Layer Index"

## Syntax (C#)
```csharp
public static ForgeTypeId DpartLayerIndex { get; }
```